# Задача 3. Напишите программу, которая по заданному номеру четверти, 
# показывает диапазон возможных координат точек в этой четверти (x и y).

kvadrant = int (input('Введите номер четверти: '))

if (kvadrant = 1):
    print('Диапазон от 0 до ')
elif (x < 0 and y >0)
    print('Вторая четверть')
    else:
        if (x < 0 and y < 0):
            print('Третья четверть')
        else:
            if (x > 0 and y < 0):
                print('Четвертая четверть')